Revit 2027 API
ParameterTypeId.ClassificationCode Property
 "Classification Number"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ClassificationCode { get; }
Public Shared ReadOnly Property ClassificationCode As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ClassificationCode {
	ForgeTypeId^ get ();
}
static member ClassificationCode : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace